<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\User;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {


        $users = [
            [
                "idd" => "38551",
                "name" => "يوسف محمد عبد الحليم أبو سلمية"
            ],
            [
                "idd" => "20458",
                "name" => "إيهاب إبراهيم محمد الريس"
            ],
            [
                "idd" => "22645",
                "name" => "أشرف محمد أحمد الشرفا"
            ],
            [
                "idd" => "25281",
                "name" => "أشرف رشاد عيسي الحلو"
            ],
            [
                "idd" => "25423",
                "name" => "منير نظمي عنبر الأغا"
            ],
            [
                "idd" => "38552",
                "name" => "حسن محمد حسن عقيلان"
            ],
            [
                "idd" => "38554",
                "name" => "نهاد إسحاق عبد السلام أبو هويدي"
            ],
            [
                "idd" => "41694",
                "name" => "علي داود موسى الجديلي"
            ],
            [
                "idd" => "41686",
                "name" => "عدنان محمد عبد القادر الباز"
            ],
            [
                "idd" => "41693",
                "name" => "محمد سفيان محمد عرفه"
            ],
            [
                "idd" => "45841",
                "name" => "أحمد نافذ محمود المشهراوي"
            ],
            [
                "idd" => "47432",
                "name" => "رامي عبدالله مصطفى محفوظ"
            ],
            [
                "idd" => "204762",
                "name" => "أشرف درويش مصطفى أبو موسى"
            ],
            [
                "idd" => "208371",
                "name" => "أحمد محمد عبدالله الغول"
            ],
            [
                "idd" => "211215",
                "name" => "هيثم جميل حسين عواجه"
            ],
            [
                "idd" => "213087",
                "name" => "سعيد محمد فخري عبد أبو وردة"
            ],
            [
                "idd" => "213085",
                "name" => "أسامة أحمد إبراهيم قنديل"
            ],
            [
                "idd" => "213084",
                "name" => "حسن علي حسن المباشر"
            ],
            [
                "idd" => "213140",
                "name" => "إبراهيم رباح إبراهيم المدهون"
            ],
            [
                "idd" => "213141",
                "name" => "محمد خير/ حلمي خير النجار"
            ],
            [
                "idd" => "213226",
                "name" => "آمنة فياض سليمان أبو مدين"
            ],
            [
                "idd" => "213220",
                "name" => "حسام أحمد محمود أبو عنزة"
            ],
            [
                "idd" => "213218",
                "name" => "أشرف عبد الكريم علي عمارة"
            ],
            [
                "idd" => "221759",
                "name" => "باسل فضل أحمد العابد"
            ],
            [
                "idd" => "223520",
                "name" => "أشرف إسماعيل محمود أبو سمرة"
            ],
            [
                "idd" => "223757",
                "name" => "عدنان هاني عدنان الجعفراوي"
            ],
            [
                "idd" => "223773",
                "name" => "إسراء حامد محمود المدهون"
            ],
            [
                "idd" => "223771",
                "name" => "يحيى فريد غازي الهرش"
            ],
            [
                "idd" => "211233",
                "name" => "تيسير عبد الرحمن عبدالله المصري"
            ],
            [
                "idd" => "211897",
                "name" => "سمر إبراهيم عبد الرحمن إسماعيل"
            ],
            [
                "idd" => "213082",
                "name" => "بشير أحمد حمدان جاد الله"
            ],
            [
                "idd" => "212832",
                "name" => "يحيي زكريا محمد انصيو"
            ],
            [
                "idd" => "213083",
                "name" => "رائد حنفي حسن السباح"
            ],
            [
                "idd" => "213221",
                "name" => "إسماعيل سليمان حسين شتات"
            ],
            [
                "idd" => "213219",
                "name" => "عماد منصور أحمد حلاوة"
            ],
            [
                "idd" => "215721",
                "name" => "وائل محمد محمود أبو غبن"
            ],
            [
                "idd" => "215560",
                "name" => "محمد مازن روبين  شعبان أبو راس"
            ],
            [
                "idd" => "220337",
                "name" => "عاطف إبراهيم سلامة أبو عويض"
            ],
            [
                "idd" => "221640",
                "name" => "محمد شعبان محمد عطية"
            ],
            [
                "idd" => "222553",
                "name" => "فارس إلياس جورج الصوري"
            ],
            [
                "idd" => "228539",
                "name" => "أيمن جمال كامل داود"
            ],
            [
                "idd" => "226872",
                "name" => "دينا عمر حسين ابو شقة"
            ],
            [
                "idd" => "226984",
                "name" => "إبراهيم العبد خالد الزيني"
            ],
            [
                "idd" => "226985",
                "name" => "محمود سعد حماد الدحدوح"
            ],
            [
                "idd" => "234567",
                "name" => "أشرف محمد عبد الرحمن الفرانى"
            ],
            [
                "idd" => "226990",
                "name" => "إبراهيم سميح سعيد ابو مايلة "
            ],
            [
                "idd" => "227032",
                "name" => "أحمد جهاد محمد الحطاب "
            ],
            [
                "idd" => "226986",
                "name" => "محمود محمد شعبان شامية "
            ],
            [
                "idd" => "233333",
                "name" => "محمد عاهد عبد ربه مشتهى "
            ],
            [
                "idd" => "229301",
                "name" => "محمد أحمد العربي أبو فول"
            ],
            [
                "idd" => "224388",
                "name" => "سلمان نايف أحمد أبو طويلة "
            ],
            [
                "idd" => "231558",
                "name" => "عبد الله تيسير عبد الله الخطيب"
            ],
            [
                "idd" => "228155",
                "name" => "سيف الدين صلاح محمد بهار"
            ],
            [
                "idd" => "229782",
                "name" => "عادل بسام عادل زقوت"
            ],
            [
                "idd" => "232026",
                "name" => "علاء أحمد محمود الجدي"
            ],
            [
                "idd" => "232049",
                "name" => "أحمد كمال مصطفى عياش"
            ],
            [
                "idd" => "232766",
                "name" => "عبير طاهر الأمير عابد"
            ],
            [
                "idd" => "232965",
                "name" => "أحمد محمود عبد الرحيم السحار"
            ],
            [
                "idd" => "233307",
                "name" => "محمود عايد حسن الغولة"
            ],
            [
                "idd" => "233304",
                "name" => "عبدالوهاب سليم زين الدين"
            ],
            [
                "idd" => "233328",
                "name" => "أنس أحمد مطلق أبو سلعه"
            ],
            [
                "idd" => "233418",
                "name" => "محمود سعدي محمود الأدهم "
            ],
            [
                "idd" => "233675",
                "name" => "يسرا محمد عبد المجيد أبو كويك"
            ]
        ];;

        // \App\Models\User::factory(10)->create();

        User::factory()->create([
            'name' => 'Admin',
            'email' => 'admin@admin.com',
            'password' => bcrypt('password'),
            'ssn' => '123456',
        ]);

        foreach ($users as $user) {
            User::factory()->create([
                'name' => $user['name'],
                'remember_token' => Str::random(10),
                'password' => bcrypt('password'),
                'is_admin' => 0,
            ]);
        }
    }
}
