<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\User;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {


        $users = [
            [
                "ssn" => "901006395",
                "name" => "يوسف محمد عبدالحليم أبو سلمية"
            ],
            [
                "ssn" => "801604356",
                "name" => "إبراهيم رباح إبراهيم المدهون"
            ],
            [
                "ssn" => "991206921",
                "name" => "سمر إبراهيم عبد الرحمن إسماعيل"
            ],
            [
                "ssn" => "801976432",
                "name" => "دينا عمر حسين ابو شقة"
            ],
            [
                "ssn" => "803337831",
                "name" => "عبير طاهر الأمير عابد"
            ],
            [
                "ssn" => "901384339",
                "name" => "أحمد نافذ محمود المشهراوي"
            ],
            [
                "ssn" => "900523689",
                "name" => "أشرف إسماعيل محمود أبو سمرة"
            ],
            [
                "ssn" => "801809435",
                "name" => "آمنة فياض سليمان أبو مدين"
            ],
            [
                "ssn" => "901439091",
                "name" => "بشير أحمد حمدان جاد الله"
            ],
            [
                "ssn" => "801516873",
                "name" => "يحيي زكريا محمد انصيو"
            ],
            [
                "ssn" => "412234130",
                "name" => "إبراهيم العبد خالد الزيني"
            ],
            [
                "ssn" => "400989596",
                "name" => "محمود سعد حماد الدحدوح"
            ],
            [
                "ssn" => "903481802",
                "name" => "هيثم جميل حسين عواجه"
            ],
            [
                "ssn" => "804588424",
                "name" => "علاء أحمد محمود الجدي"
            ],
            [
                "ssn" => "802852566",
                "name" => "أحمد محمود عبدالرحيم السحار"
            ],
            [
                "ssn" => "936922756",
                "name" => "سعيد محمد عبد أبو وردة"
            ],
            [
                "ssn" => "903066918",
                "name" => "رامي عبدالله مصطفى محفوظ"
            ],
            [
                "ssn" => "980338107",
                "name" => "عاطف إبراهيم سلامة أبو عويض"
            ],
            [
                "ssn" => "921693594",
                "name" => "محمدمازن روبين  شعبان أبو راس"
            ],
            [
                "ssn" => "925208217",
                "name" => "فارس إلياس جورج الصوري"
            ],
            [
                "ssn" => "801354614",
                "name" => "سيف الدين صلاح محمد بهار"
            ],
            [
                "ssn" => "901462044",
                "name" => "تيسير عبد الرحمن عبدالله المصري"
            ],
            [
                "ssn" => "934331232",
                "name" => "إسماعيل سليمان حسين شتات"
            ],
            [
                "ssn" => "912269271",
                "name" => "وائل محمد محمود أبو غبن"
            ],
            [
                "ssn" => "801117268",
                "name" => "أحمد محمد عبدالله الغول"
            ],
            [
                "ssn" => "804520955",
                "name" => "محمود سعدي محمود الأدهم "
            ],
            [
                "ssn" => "800136780",
                "name" => "سلمان نايف أحمد أبو طويلة "
            ],
            [
                "ssn" => "412504060",
                "name" => "أشرف محمد أحمد الشرفا"
            ],
            [
                "ssn" => "900875220",
                "name" => "علي داود موسى الجديلي"
            ],
            [
                "ssn" => "801542192",
                "name" => "حسن علي حسن المباشر"
            ],
            [
                "ssn" => "804545895",
                "name" => "إبراهيم سميح سعيد ابو مايلة "
            ],
            [
                "ssn" => "908190101",
                "name" => "إيهاب إبراهيم محمد الريس"
            ],
            [
                "ssn" => "901646315",
                "name" => "محمد سفيان محمد عرفه"
            ],
            [
                "ssn" => "400156949",
                "name" => "عبد الله تيسير عبد الله الخطيب"
            ],
            [
                "ssn" => "802164079",
                "name" => "أحمد كمال مصطفى عياش"
            ],
            [
                "ssn" => "903994101",
                "name" => "أشرف رشاد عيسي الحلو"
            ],
            [
                "ssn" => "900767690",
                "name" => "عدنان محمد عبد القادر الباز"
            ],
            [
                "ssn" => "926752957",
                "name" => "حسام أحمد محمود أبو عنزة"
            ],
            [
                "ssn" => "802626309",
                "name" => "إسراء حامد محمود المدهون"
            ],
            [
                "ssn" => "802772525",
                "name" => "يحيى فريد غازي الهرش"
            ],
            [
                "ssn" => "905264354",
                "name" => "عماد منصور أحمد حلاوة"
            ],
            [
                "ssn" => "405262825",
                "name" => "يسرا محمد عبد المجيد أبو كويك"
            ],
            [
                "ssn" => "900243874",
                "name" => "منير نظمي عنبر الأغا"
            ],
            [
                "ssn" => "802592527",
                "name" => "عدنان هاني عدنان الجعفراوي"
            ],
            [
                "ssn" => "931659734",
                "name" => "باسل فضل أحمد العابد"
            ],
            [
                "ssn" => "801230285",
                "name" => "أشرف محمد عبد الرحمن الفرانى"
            ],
            [
                "ssn" => "401208129",
                "name" => "عادل بسام عادل زقوت"
            ],
            [
                "ssn" => "803629260",
                "name" => "محمد أحمد العربي أبو فول"
            ],
            [
                "ssn" => "404750168",
                "name" => "عبدالوهاب سليم زين الدين"
            ],
            [
                "ssn" => "900306580",
                "name" => "حسن محمد حسن عقيلان"
            ],
            [
                "ssn" => "900983578",
                "name" => "أشرف عبد الكريم علي عمارة"
            ],
            [
                "ssn" => "994024339",
                "name" => "أسامة أحمد إبراهيم قنديل"
            ],
            [
                "ssn" => "800277873",
                "name" => "محمد شعبان محمد عطية"
            ],
            [
                "ssn" => "903277762",
                "name" => "رائد حنفي حسن السباح"
            ],
            [
                "ssn" => "400559373",
                "name" => "أحمد جهاد محمد الحطاب "
            ],
            [
                "ssn" => "404672248",
                "name" => "أنس أحمد مطلق أبو سلعة "
            ],
            [
                "ssn" => "900838871",
                "name" => "نهاد إسحق عبد السلام أبو هويدي"
            ],
            [
                "ssn" => "926685322",
                "name" => "محمد خير/ حلمي خير النجار"
            ],
            [
                "ssn" => "410611289",
                "name" => "أيمن جمال كامل داود"
            ],
            [
                "ssn" => "401083605",
                "name" => "محمود محمد شعبان شامية "
            ],
            [
                "ssn" => "401768684",
                "name" => "محمد عاهد عبد ربه مشتهى "
            ],
            [
                "ssn" => "804570216",
                "name" => "محمود عايد حسن الغولة"
            ],
        ];


        // \App\Models\User::factory(10)->create();

        User::factory()->create([
            'name' => 'Admin',
            'email' => 'admin@admin.com',
            'password' => bcrypt('password'),
            'ssn' => '123456',
        ]);

        foreach ($users as $user) {
            User::factory()->create([
                'ssn' => $user['ssn'],
                'name' => $user['name'],
                'remember_token' => Str::random(10),
                'password' => bcrypt('password'),
                'is_admin' => 0,
            ]);
        }
    }
}
