@component('mail::message')
    <div class="" dir="rtl">
        السيد / ة: {{$user->name}}
        <br>
        أهلا وسهلاً بك
        لقد تم انشاء حساب لك في موقع اكاديمية حرف بالاعتماد على البيانات المدخلة:
        <br>
        الاسم: {{$user->name}}
        <br>
        رقم الهاتف: {{$user->phone}}
        <br>
        البريد الالكتروني: {{$user->email}}
        <br>
        يمكنك تسجيل الدخول لحسابك في الموقع والاطلاع على الدورات المشترك بها من خلال استخدام البيانات التالية:
        <br>
        البريد الالكتروني: {{$user->email}}
        <br>
        كلمة المرور: {{$password}}
    </div>
@endcomponent
